#pragma once

/// ===================================================
/// ファイルを開く動作のインターフェイスクラス
/// ===================================================
class IOpenFile {
public:
	/// ===================================================
	/// public : virtual methods
	/// ===================================================

	virtual ~IOpenFile() = default;

	virtual void OpenFile() = 0;
};


/// ===================================================
/// pngのファイルを開く
/// ===================================================
class Png : public IOpenFile {
public:
	void OpenFile() override;
};



/// ===================================================
/// txtのファイルを開く
/// ===================================================
class Txt : public IOpenFile {
public:
	void OpenFile() override;
};



/// ===================================================
/// exeのファイルを開く
/// ===================================================
class Exe : public IOpenFile {
public:
	void OpenFile() override;
};